; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v2 ?v4)
             (pred_2 ?v5 ?v8)
             (pred_1 ?v2 ?v8)
             (pred_3 ?v9 ?v2 )
	     (pred_4 ?v2)
             (pred_9 ?v1)
             (pred_5 ?v5)
             (pred_6 ?v8)
             (pred_12 ?v2)
             (pred_11 ?v5)
             (pred_10 ?v2)
             (pred_8 ))



(:action op_1
:parameters (?v13 ?v6 ?v10 ?v12)
:precondition (and (pred_9 ?v13) (pred_9 ?v6) (pred_5 ?v10) (pred_6 ?v12)
          (pred_7 ?v13 ?v6) (pred_2 ?v10 ?v12)
                   (pred_1 ?v6 ?v12) (pred_4 ?v13) 
                   (pred_12 ?v6) (pred_11 ?v10))
:effect (and  (pred_10 ?v6) (not (pred_12 ?v6))))


(:action op_4
:parameters (?v13 ?v7)
:precondition (and (pred_9 ?v13) (pred_9 ?v7)
               (pred_4 ?v13) (pred_7 ?v13 ?v7) (pred_10 ?v7))
:effect (and (pred_4 ?v7) (not (pred_4 ?v13))))

(:action op_5
:parameters (?v13 ?v10)
:precondition (and (pred_9 ?v13) (pred_5 ?v10) 
                  (pred_4 ?v13) (pred_3 ?v10 ?v13) (pred_8 ))
:effect (and (pred_11 ?v10)
   (not (pred_3 ?v10 ?v13)) (not (pred_8 ))))


(:action op_2
:parameters (?v13 ?v3 ?v11)
:precondition (and (pred_9 ?v13) (pred_5 ?v3) (pred_5 ?v11)
                  (pred_4 ?v13) (pred_11 ?v11) (pred_3 ?v3 ?v13))
:effect (and (pred_11 ?v3) (pred_3 ?v11 ?v13)
        (not (pred_11 ?v11)) (not (pred_3 ?v3 ?v13))))

(:action op_3
:parameters (?v13 ?v10)
:precondition (and (pred_9 ?v13) (pred_5 ?v10) 
                  (pred_4 ?v13) (pred_11 ?v10))
:effect (and (pred_8 ) (pred_3 ?v10 ?v13) (not (pred_11 ?v10)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_08 obj_14 obj_19 obj_05 obj_20 obj_16 obj_21 obj_07 obj_18 obj_22 obj_01 obj_04 obj_09 obj_17 obj_06
    obj_11 obj_03 obj_02
    obj_13 obj_12 obj_15
    )

    (:init
       (pred_8)

       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_14)
       (pred_9 obj_19)
       (pred_9 obj_05)
       (pred_9 obj_20)
       (pred_9 obj_16)
       (pred_9 obj_21)
       (pred_9 obj_07)
       (pred_9 obj_18)
       (pred_9 obj_22)
       (pred_9 obj_01)
       (pred_9 obj_04)
       (pred_9 obj_09)
       (pred_9 obj_17)
       (pred_9 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_03)
       (pred_6 obj_02)
       (pred_5 obj_13)
       (pred_5 obj_12)
       (pred_5 obj_15)

       (pred_7 obj_10 obj_05)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_08 obj_20)
       (pred_7 obj_08 obj_14)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_14 obj_16)
       (pred_7 obj_14 obj_19)
       (pred_7 obj_14 obj_08)
       (pred_7 obj_19 obj_21)
       (pred_7 obj_19 obj_14)
       (pred_7 obj_05 obj_07)
       (pred_7 obj_05 obj_20)
       (pred_7 obj_05 obj_10)
       (pred_7 obj_20 obj_18)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_20 obj_05)
       (pred_7 obj_16 obj_22)
       (pred_7 obj_16 obj_21)
       (pred_7 obj_16 obj_14)
       (pred_7 obj_16 obj_20)
       (pred_7 obj_21 obj_01)
       (pred_7 obj_21 obj_19)
       (pred_7 obj_21 obj_16)
       (pred_7 obj_07 obj_04)
       (pred_7 obj_07 obj_18)
       (pred_7 obj_07 obj_05)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_18 obj_22)
       (pred_7 obj_18 obj_20)
       (pred_7 obj_18 obj_07)
       (pred_7 obj_22 obj_17)
       (pred_7 obj_22 obj_01)
       (pred_7 obj_22 obj_16)
       (pred_7 obj_22 obj_18)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_01 obj_21)
       (pred_7 obj_01 obj_22)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_07)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_09 obj_18)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_17 obj_06)
       (pred_7 obj_17 obj_22)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_06 obj_01)
       (pred_7 obj_06 obj_17)
       (pred_12 obj_06)
       (pred_12 obj_01)
       (pred_12 obj_04)
       (pred_1  obj_06 obj_11)
       (pred_1  obj_01 obj_03)
       (pred_1  obj_04 obj_02)
       (pred_10 obj_10)
       (pred_10 obj_08)
       (pred_10 obj_14)
       (pred_10 obj_19)
       (pred_10 obj_05)
       (pred_10 obj_20)
       (pred_10 obj_16)
       (pred_10 obj_21)
       (pred_10 obj_07)
       (pred_10 obj_18)
       (pred_10 obj_22)
       (pred_10 obj_09)
       (pred_10 obj_17)

       (pred_2  obj_13 obj_11)
       (pred_2  obj_12 obj_03)
       (pred_2  obj_15 obj_02)
       (pred_3 obj_13 obj_14)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_15 obj_19)
       (pred_4 obj_14)
    )

    (:goal (and
       (pred_3 obj_12 obj_09)
       (pred_3 obj_15 obj_04)
    ))
(:constraints
  (always (not (pred_4 obj_18)))
)
)

; plan
1. (op_4 obj_14 obj_19)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_19)
   goals met: 0 of 2
2. (op_5 obj_19 obj_15)
   deleted: (pred_3 obj_15 obj_19) (pred_8)
   added: (pred_11 obj_15)
   goals met: 0 of 2
3. (op_4 obj_19 obj_14)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_14)
   goals met: 0 of 2
4. (op_4 obj_14 obj_08)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_08)
   goals met: 0 of 2
5. (op_4 obj_08 obj_20)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_20)
   goals met: 0 of 2
6. (op_4 obj_20 obj_05)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_05)
   goals met: 0 of 2
7. (op_4 obj_05 obj_07)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_07)
   goals met: 0 of 2
8. (op_1 obj_07 obj_04 obj_15 obj_02)
   deleted: (pred_12 obj_04)
   added: (pred_10 obj_04)
   goals met: 0 of 2
9. (op_4 obj_07 obj_04)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_04)
   goals met: 0 of 2
10. (op_4 obj_04 obj_09)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_09)
   goals met: 0 of 2
11. (op_3 obj_09 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_8) (pred_3 obj_15 obj_09)
   goals met: 0 of 2
12. (op_4 obj_09 obj_04)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_04)
   goals met: 0 of 2
13. (op_4 obj_04 obj_07)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_07)
   goals met: 0 of 2
14. (op_4 obj_07 obj_05)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_05)
   goals met: 0 of 2
15. (op_4 obj_05 obj_20)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_20)
   goals met: 0 of 2
16. (op_4 obj_20 obj_08)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_08)
   goals met: 0 of 2
17. (op_4 obj_08 obj_14)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_14)
   goals met: 0 of 2
18. (op_4 obj_14 obj_19)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_19)
   goals met: 0 of 2
19. (op_5 obj_19 obj_12)
   deleted: (pred_3 obj_12 obj_19) (pred_8)
   added: (pred_11 obj_12)
   goals met: 0 of 2
20. (op_4 obj_19 obj_14)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_14)
   goals met: 0 of 2
21. (op_4 obj_14 obj_08)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_08)
   goals met: 0 of 2
22. (op_4 obj_08 obj_20)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_20)
   goals met: 0 of 2
23. (op_4 obj_20 obj_05)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_05)
   goals met: 0 of 2
24. (op_4 obj_05 obj_07)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_07)
   goals met: 0 of 2
25. (op_4 obj_07 obj_04)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_04)
   goals met: 0 of 2
26. (op_4 obj_04 obj_09)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_09)
   goals met: 0 of 2
27. (op_2 obj_09 obj_15 obj_12)
   deleted: (pred_11 obj_12) (pred_3 obj_15 obj_09)
   added: (pred_11 obj_15) (pred_3 obj_12 obj_09)
   goals met: 1 of 2
28. (op_4 obj_09 obj_04)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_04)
   goals met: 1 of 2
29. (op_3 obj_04 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_8) (pred_3 obj_15 obj_04)
   goals met: 2 of 2
